Repository: Pantheleum/lolo-app
Catalog: lolo/lib/l10n/app_*.arb
Languages: ar, ms

# common_button_continue
source: Continue
ar: متابعة
ms: Teruskan

# common_button_back
source: Back
ar: رجوع
ms: Kembali

# common_button_skip
source: Skip
ar: تخطي
ms: Langkau

# common_button_save
source: Save
ar: حفظ
ms: Simpan

# common_button_cancel
source: Cancel
ar: إلغاء
ms: Batal

# common_button_delete
source: Delete
ar: حذف
ms: Padam

# common_button_done
source: Done
ar: تم
ms: Selesai

# common_button_retry
source: Retry
ar: إعادة المحاولة
ms: Cuba Semula

# common_button_close
source: Close
ar: إغلاق
ms: Tutup

# common_button_confirm
source: Confirm
ar: تأكيد
ms: Sahkan

# common_button_edit
source: Edit
ar: تعديل
ms: Sunting

# common_button_copy
source: Copy
ar: نسخ
ms: Salin

# common_button_share
source: Share
ar: مشاركة
ms: Kongsi

# common_label_loading
source: Loading...
ar: جاري التحميل...
ms: Memuatkan...

# common_label_offline
source: You're offline. Showing cached data.
ar: أنت غير متصل. عرض البيانات المخزنة.
ms: Anda di luar talian. Menunjukkan data tersimpan.

# common_label_lastUpdated
source: Last updated {time}
ar: آخر تحديث {time}
ms: Kemas kini terakhir {time}

# error_generic
source: Something went wrong. Please try again.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى.
ms: Sesuatu tidak kena. Sila cuba lagi.

# error_network
source: No internet connection. Check your network.
ar: لا يوجد اتصال بالإنترنت. تحقق من شبكتك.
ms: Tiada sambungan internet. Semak rangkaian anda.

# error_timeout
source: Request timed out. Please try again.
ar: انتهت مهلة الطلب. يرجى المحاولة مرة أخرى.
ms: Permintaan tamat masa. Sila cuba lagi.

# error_server
source: Server error. We're working on it.
ar: خطأ في الخادم. نحن نعمل على حله.
ms: Ralat pelayan. Kami sedang menyelesaikannya.

# error_unauthorized
source: Session expired. Please log in again.
ar: انتهت الجلسة. يرجى تسجيل الدخول مرة أخرى.
ms: Sesi tamat. Sila log masuk semula.

# error_rate_limited
source: Too many requests. Please wait a moment.
ar: طلبات كثيرة جداً. يرجى الانتظار لحظة.
ms: Terlalu banyak permintaan. Sila tunggu sebentar.

# error_tier_exceeded
source: Upgrade your plan to unlock this feature.
ar: قم بترقية خطتك لفتح هذه الميزة.
ms: Naik taraf pelan anda untuk membuka ciri ini.

# nav_home
source: Home
ar: الرئيسية
ms: Utama

# nav_reminders
source: Reminders
ar: التذكيرات
ms: Peringatan

# nav_messages
source: Messages
ar: الرسائل
ms: Mesej

# nav_gifts
source: Gifts
ar: الهدايا
ms: Hadiah

# nav_more
source: More
ar: المزيد
ms: Lagi

# empty_reminders_title
source: No reminders yet
ar: لا توجد تذكيرات بعد
ms: Tiada peringatan lagi

# empty_reminders_subtitle
source: Add important dates so you never forget
ar: أضف التواريخ المهمة حتى لا تنسى
ms: Tambah tarikh penting supaya tidak lupa

# empty_messages_title
source: No messages yet
ar: لا توجد رسائل بعد
ms: Tiada mesej lagi

# empty_messages_subtitle
source: Generate your first AI message
ar: أنشئ أول رسالة ذكية
ms: Jana mesej AI pertama anda

# empty_memories_title
source: No memories yet
ar: لا توجد ذكريات بعد
ms: Tiada kenangan lagi

# empty_memories_subtitle
source: Start saving moments that matter
ar: ابدأ بحفظ اللحظات المهمة
ms: Mula simpan detik yang bermakna

# onboarding_language_title
source: Choose Your Language
ar: اختر لغتك
ms: Pilih Bahasa Anda

# onboarding_welcome_tagline
source: She won't know why you got so thoughtful. We won't tell.
ar: لن تعرف لماذا أصبحت أكثر اهتماماً. لن نخبرها.
ms: Dia tak akan tahu kenapa kamu jadi lebih perhatian. Kami tak akan bagitahu.

# onboarding_welcome_benefit1_title
source: Smart Reminders
ar: تذكيرات ذكية
ms: Peringatan Pintar

# onboarding_welcome_benefit1_subtitle
source: Never forget what matters to her
ar: لا تنسَ ما يهمها أبداً
ms: Jangan lupa apa yang penting baginya

# onboarding_welcome_benefit2_title
source: AI Messages
ar: رسائل ذكية
ms: Mesej AI

# onboarding_welcome_benefit2_subtitle
source: Say the right thing, every time
ar: قل الشيء الصحيح، في كل مرة
ms: Cakap benda yang betul, setiap masa

# onboarding_welcome_benefit3_title
source: SOS Mode
ar: وضع الطوارئ
ms: Mod SOS

# onboarding_welcome_benefit3_subtitle
source: Emergency help when she's upset
ar: مساعدة فورية عندما تكون منزعجة
ms: Bantuan kecemasan bila dia sedih

# onboarding_welcome_button_start
source: Get Started
ar: ابدأ الآن
ms: Mula

# onboarding_welcome_link_login
source: Already have an account? Log in
ar: لديك حساب بالفعل؟ تسجيل الدخول
ms: Sudah ada akaun? Log masuk

# onboarding_signup_title
source: Sign Up
ar: إنشاء حساب
ms: Daftar

# onboarding_signup_heading
source: Create your account
ar: أنشئ حسابك
ms: Cipta akaun anda

# onboarding_signup_button_google
source: Continue with Google
ar: المتابعة مع Google
ms: Teruskan dengan Google

# onboarding_signup_button_apple
source: Continue with Apple
ar: المتابعة مع Apple
ms: Teruskan dengan Apple

# onboarding_signup_divider
source: or
ar: أو
ms: atau

# onboarding_signup_label_email
source: Email
ar: البريد الإلكتروني
ms: Emel

# onboarding_signup_label_password
source: Password
ar: كلمة المرور
ms: Kata Laluan

# onboarding_signup_label_confirmPassword
source: Confirm Password
ar: تأكيد كلمة المرور
ms: Sahkan Kata Laluan

# onboarding_signup_button_create
source: Create Account
ar: إنشاء حساب
ms: Cipta Akaun

# onboarding_signup_legal
source: By signing up you agree to our {terms} and {privacy}
ar: بالتسجيل أنت توافق على {terms} و{privacy}
ms: Dengan mendaftar anda bersetuju dengan {terms} dan {privacy} kami

# onboarding_signup_legal_terms
source: Terms of Service
ar: شروط الخدمة
ms: Terma Perkhidmatan

# onboarding_signup_legal_privacy
source: Privacy Policy
ar: سياسة الخصوصية
ms: Dasar Privasi

# onboarding_signup_error_emailInUse
source: This email is already registered.
ar: هذا البريد الإلكتروني مسجل بالفعل.
ms: Emel ini sudah didaftarkan.

# onboarding_signup_error_invalidEmail
source: Please enter a valid email address.
ar: يرجى إدخال بريد إلكتروني صالح.
ms: Sila masukkan alamat emel yang sah.

# onboarding_signup_error_weakPassword
source: Password must be at least 8 characters.
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل.
ms: Kata laluan mesti sekurang-kurangnya 8 aksara.

# onboarding_signup_error_networkFailed
source: Network error. Check your connection.
ar: خطأ في الشبكة. تحقق من اتصالك.
ms: Ralat rangkaian. Semak sambungan anda.

# onboarding_signup_error_generic
source: Authentication failed. Please try again.
ar: فشلت المصادقة. يرجى المحاولة مرة أخرى.
ms: Pengesahan gagal. Sila cuba lagi.

# onboarding_login_title
source: Log In
ar: تسجيل الدخول
ms: Log Masuk

# onboarding_login_heading
source: Welcome back
ar: مرحباً بعودتك
ms: Selamat kembali

# onboarding_login_button_login
source: Log In
ar: تسجيل الدخول
ms: Log Masuk

# onboarding_login_link_forgot
source: Forgot password?
ar: نسيت كلمة المرور؟
ms: Lupa kata laluan?

# onboarding_login_link_signup
source: Don't have an account? Sign up
ar: ليس لديك حساب؟ سجّل الآن
ms: Tiada akaun? Daftar sekarang

# onboarding_name_title
source: What should we call you?
ar: ماذا نناديك؟
ms: Apa nama anda?

# onboarding_name_hint
source: Your name
ar: اسمك
ms: Nama anda

# onboarding_name_error_min
source: Please enter at least 2 characters
ar: يرجى إدخال حرفين على الأقل
ms: Sila masukkan sekurang-kurangnya 2 aksara

# onboarding_partner_title
source: Who is the special one?
ar: من هي المميزة؟
ms: Siapa yang istimewa?

# onboarding_partner_hint
source: Her name
ar: اسمها
ms: Nama dia

# onboarding_partner_label_zodiac
source: Her zodiac sign (optional)
ar: برجها (اختياري)
ms: Zodiak dia (pilihan)

# onboarding_partner_label_zodiacUnknown
source: I don't know her sign
ar: لا أعرف برجها
ms: Saya tak tahu zodiak dia

# onboarding_partner_label_status
source: Relationship status
ar: حالة العلاقة
ms: Status hubungan

# onboarding_partner_error_name
source: Please enter her name
ar: يرجى إدخال اسمها
ms: Sila masukkan nama dia

# onboarding_status_dating
source: Dating
ar: مواعدة
ms: Bercinta

# onboarding_status_engaged
source: Engaged
ar: خطوبة
ms: Bertunang

# onboarding_status_newlywed
source: Newlywed
ar: عروسان جدد
ms: Pengantin Baru

# onboarding_status_married
source: Married
ar: متزوجان
ms: Berkahwin

# onboarding_status_longDistance
source: Long Distance
ar: علاقة عن بعد
ms: Jarak Jauh

# onboarding_anniversary_title
source: When did your story begin?
ar: متى بدأت قصتكما؟
ms: Bila kisah kamu bermula?

# onboarding_anniversary_label_dating
source: Dating anniversary
ar: ذكرى المواعدة
ms: Ulang tahun bercinta

# onboarding_anniversary_label_wedding
source: Wedding date
ar: تاريخ الزفاف
ms: Tarikh perkahwinan

# onboarding_anniversary_select_date
source: Select a date
ar: اختر تاريخاً
ms: Pilih tarikh

# onboarding_firstCard_title
source: Your first smart card for {partnerName}
ar: أول بطاقة ذكية لـ {partnerName}
ms: Kad pintar pertama untuk {partnerName}

# onboarding_firstCard_personalized
source: Personalized for {partnerName}
ar: مخصصة لـ {partnerName}
ms: Dikhaskan untuk {partnerName}

# profile_title
source: Her Profile
ar: ملفها الشخصي
ms: Profil Dia

# profile_completion
source: {percent}% complete
ar: مكتمل {percent}%
ms: {percent}% lengkap

# profile_nav_zodiac
source: Zodiac & Traits
ar: البرج والصفات
ms: Zodiak & Sifat

# profile_nav_zodiac_empty
source: Not set yet
ar: لم يتم التحديد بعد
ms: Belum ditetapkan

# profile_nav_preferences
source: Preferences
ar: التفضيلات
ms: Keutamaan

# profile_nav_preferences_subtitle
source: {count} items recorded
ar: {count} عنصر مسجل
ms: {count} item direkodkan

# profile_nav_cultural
source: Cultural Context
ar: السياق الثقافي
ms: Konteks Budaya

# profile_nav_cultural_empty
source: Not set yet
ar: لم يتم التحديد بعد
ms: Belum ditetapkan

# profile_edit_title
source: Edit Profile
ar: تعديل الملف
ms: Sunting Profil

# profile_edit_zodiac_traits
source: Zodiac Traits
ar: صفات البرج
ms: Sifat Zodiak

# profile_edit_loveLanguage
source: Her Love Language
ar: لغة حبها
ms: Bahasa Cinta Dia

# profile_edit_commStyle
source: Communication Style
ar: أسلوب التواصل
ms: Gaya Komunikasi

# profile_edit_conflictStyle
source: Conflict Style
ar: أسلوب التعامل مع الخلافات
ms: Gaya Konflik

# profile_edit_loveLanguage_words
source: Words of Affirmation
ar: كلمات التشجيع
ms: Kata-kata Pujian

# profile_edit_loveLanguage_acts
source: Acts of Service
ar: أفعال الخدمة
ms: Tindakan Perkhidmatan

# profile_edit_loveLanguage_gifts
source: Receiving Gifts
ar: تلقي الهدايا
ms: Menerima Hadiah

# profile_edit_loveLanguage_time
source: Quality Time
ar: وقت مميز معاً
ms: Masa Berkualiti

# profile_edit_loveLanguage_touch
source: Physical Touch
ar: التواصل الجسدي
ms: Sentuhan Fizikal

# profile_edit_commStyle_direct
source: Direct
ar: مباشر
ms: Langsung

# profile_edit_commStyle_indirect
source: Indirect
ar: غير مباشر
ms: Tidak Langsung

# profile_edit_commStyle_mixed
source: Mixed
ar: مختلط
ms: Campuran

# profile_preferences_title
source: Her Preferences
ar: تفضيلاتها
ms: Keutamaan Dia

# profile_preferences_favorites
source: Favorites
ar: المفضلات
ms: Kegemaran

# profile_preferences_add_hint
source: Add {category}...
ar: أضف {category}...
ms: Tambah {category}...

# profile_preferences_hobbies
source: Hobbies & Interests
ar: الهوايات والاهتمامات
ms: Hobi & Minat

# profile_preferences_dislikes
source: Dislikes & Triggers
ar: الأشياء التي لا تحبها
ms: Tidak Suka & Pencetus

# profile_preferences_category_flowers
source: Flowers
ar: زهور
ms: Bunga

# profile_preferences_category_food
source: Food
ar: طعام
ms: Makanan

# profile_preferences_category_music
source: Music
ar: موسيقى
ms: Muzik

# profile_preferences_category_movies
source: Movies
ar: أفلام
ms: Filem

# profile_preferences_category_brands
source: Brands
ar: ماركات
ms: Jenama

# profile_preferences_category_colors
source: Colors
ar: ألوان
ms: Warna

# profile_cultural_title
source: Cultural Context
ar: السياق الثقافي
ms: Konteks Budaya

# profile_cultural_background
source: Cultural Background
ar: الخلفية الثقافية
ms: Latar Belakang Budaya

# profile_cultural_background_hint
source: Select background
ar: اختر الخلفية
ms: Pilih latar belakang

# profile_cultural_observance
source: Religious Observance
ar: الالتزام الديني
ms: Amalan Keagamaan

# profile_cultural_dialect
source: Arabic Dialect
ar: اللهجة العربية
ms: Dialek Arab

# profile_cultural_dialect_hint
source: Select dialect
ar: اختر اللهجة
ms: Pilih dialek

# profile_cultural_info
source: This helps LOLO personalize AI content, filter inappropriate suggestions, and auto-add relevant holidays to your reminders.
ar: هذا يساعد LOLO في تخصيص المحتوى، وتصفية الاقتراحات غير المناسبة، وإضافة المناسبات تلقائياً.
ms: Ini membantu LOLO menyesuaikan kandungan AI, menapis cadangan yang tidak sesuai, dan menambah hari kelepasan yang berkaitan secara automatik.

# profile_cultural_bg_gulf
source: Gulf Arab
ar: خليجي
ms: Arab Teluk

# profile_cultural_bg_levantine
source: Levantine
ar: شامي

# profile_cultural_bg_egyptian
source: Egyptian
ar: مصري
ms: Mesir

# profile_cultural_bg_northAfrican
source: North African
ar: شمال أفريقي
ms: Afrika Utara

# profile_cultural_bg_malay
source: Malaysian/Malay
ar: ماليزي/ملايو
ms: Malaysia/Melayu

# profile_cultural_bg_western
source: Western
ar: غربي
ms: Barat

# profile_cultural_bg_southAsian
source: South Asian
ar: جنوب آسيوي
ms: Asia Selatan

# profile_cultural_bg_eastAsian
source: East Asian
ar: شرق آسيوي
ms: Asia Timur

# profile_cultural_bg_other
source: Other
ar: أخرى
ms: Lain-lain

# profile_cultural_obs_high
source: High -- Observes all religious practices
ar: عالي -- يلتزم بجميع الممارسات الدينية
ms: Tinggi -- Mengamalkan semua amalan keagamaan

# profile_cultural_obs_moderate
source: Moderate -- Observes major practices
ar: متوسط -- يلتزم بالممارسات الرئيسية
ms: Sederhana -- Mengamalkan amalan utama

# profile_cultural_obs_low
source: Low -- Culturally connected
ar: منخفض -- مرتبط ثقافياً
ms: Rendah -- Berkaitan secara budaya

# profile_cultural_obs_secular
source: Secular
ar: علماني
ms: Sekular

# reminders_title
source: Reminders
ar: التذكيرات
ms: Peringatan

# reminders_view_list
source: List view
ar: عرض القائمة
ms: Paparan senarai

# reminders_view_calendar
source: Calendar view
ar: عرض التقويم
ms: Paparan kalendar

# reminders_section_overdue
source: Overdue
ar: متأخرة
ms: Tertunggak

# reminders_section_upcoming
source: Upcoming
ar: قادمة
ms: Akan Datang

# reminders_create_title
source: New Reminder
ar: تذكير جديد
ms: Peringatan Baru

# reminders_create_label_title
source: Title
ar: العنوان
ms: Tajuk

# reminders_create_hint_title
source: e.g. Her birthday
ar: مثلاً: عيد ميلادها
ms: cth. Hari lahir dia

# reminders_create_label_category
source: Category
ar: الفئة
ms: Kategori

# reminders_create_label_date
source: Date
ar: التاريخ
ms: Tarikh

# reminders_create_label_time
source: Time (optional)
ar: الوقت (اختياري)
ms: Masa (pilihan)

# reminders_create_label_recurrence
source: Repeat
ar: التكرار
ms: Ulang

# reminders_create_label_notes
source: Notes (optional)
ar: ملاحظات (اختياري)
ms: Nota (pilihan)

# reminders_create_hint_notes
source: Add any additional details...
ar: أضف أي تفاصيل إضافية...
ms: Tambah sebarang butiran tambahan...

# reminders_create_button_save
source: Create Reminder
ar: إنشاء تذكير
ms: Cipta Peringatan

# reminders_create_recurrence_none
source: No repeat
ar: بدون تكرار
ms: Tiada ulangan

# reminders_create_recurrence_weekly
source: Weekly
ar: أسبوعياً
ms: Mingguan

# reminders_create_recurrence_monthly
source: Monthly
ar: شهرياً
ms: Bulanan

# reminders_create_recurrence_yearly
source: Yearly
ar: سنوياً
ms: Tahunan

# reminders_create_category_birthday
source: Birthday
ar: عيد ميلاد
ms: Hari Lahir

# reminders_create_category_anniversary
source: Anniversary
ar: ذكرى سنوية
ms: Ulang Tahun

# reminders_create_category_islamic
source: Islamic Holiday
ar: عيد إسلامي
ms: Hari Raya Islam

# reminders_create_category_cultural
source: Cultural
ar: ثقافي
ms: Budaya

# reminders_create_category_custom
source: Custom
ar: مخصص
ms: Tersuai

# reminders_create_category_promise
source: Promise
ar: وعد
ms: Janji

# reminders_create_error_title
source: Title is required
ar: العنوان مطلوب
ms: Tajuk diperlukan

# reminders_create_error_date
source: Please select a date
ar: يرجى اختيار تاريخ
ms: Sila pilih tarikh

# reminders_create_error_pastDate
source: Reminder date cannot be in the past
ar: لا يمكن أن يكون تاريخ التذكير في الماضي
ms: Tarikh peringatan tidak boleh pada masa lalu

# reminders_detail_title
source: Reminder Details
ar: تفاصيل التذكير
ms: Butiran Peringatan

# reminders_detail_date
source: Date
ar: التاريخ
ms: Tarikh

# reminders_detail_time
source: Time
ar: الوقت
ms: Masa

# reminders_detail_daysUntil
source: Days until
ar: أيام متبقية
ms: Hari lagi

# reminders_detail_recurrence
source: Repeats
ar: يتكرر
ms: Berulang

# reminders_detail_notes
source: Notes
ar: ملاحظات
ms: Nota

# reminders_detail_button_complete
source: Mark as Complete
ar: تم الإنجاز
ms: Tandakan Selesai

# reminders_detail_button_snooze
source: Snooze
ar: تأجيل
ms: Tangguhkan

# reminders_detail_completed
source: Completed
ar: مكتمل
ms: Selesai

# reminders_detail_overdue
source: {days} days overdue
ar: متأخر {days} يوم
ms: Tertunggak {days} hari

# reminders_detail_inDays
source: In {days} days
ar: بعد {days} يوم
ms: Dalam {days} hari

# reminders_detail_today
source: Today
ar: اليوم
ms: Hari ini

# reminders_snooze_title
source: Snooze for...
ar: تأجيل لمدة...
ms: Tangguhkan selama...

# reminders_snooze_1h
source: 1 hour
ar: ساعة واحدة
ms: 1 jam

# reminders_snooze_3h
source: 3 hours
ar: 3 ساعات
ms: 3 jam

# reminders_snooze_1d
source: 1 day
ar: يوم واحد
ms: 1 hari

# reminders_snooze_3d
source: 3 days
ar: 3 أيام
ms: 3 hari

# reminders_snooze_1w
source: 1 week
ar: أسبوع واحد
ms: 1 minggu

# reminders_delete_title
source: Delete Reminder
ar: حذف التذكير
ms: Padam Peringatan

# reminders_delete_message
source: This will permanently delete this reminder and cancel all its notifications. Are you sure?
ar: سيتم حذف هذا التذكير نهائياً وإلغاء جميع إشعاراته. هل أنت متأكد؟
ms: Peringatan ini akan dipadamkan secara kekal dan semua pemberitahuannya akan dibatalkan. Adakah anda pasti?

# reminders_notification_today
source: Today is the day!
ar: اليوم هو اليوم!
ms: Hari ini hari yang ditunggu!

# reminders_notification_daysUntil
source: {days} days until {title}
ar: باقي {days} يوم على {title}
ms: {days} hari lagi sebelum {title}

# reminders_count
source: {count, plural, =0{No reminders} =1{1 reminder} other{{count} reminders}}
ar: {count, plural, =0{لا تذكيرات} =1{تذكير واحد} =2{تذكيران} few{{count} تذكيرات} many{{count} تذكيرًا} other{{count} تذكير}}
ms: {count, plural, =0{Tiada peringatan} =1{1 peringatan} other{{count} peringatan}}

# profile_items_count
source: {count, plural, =0{No items} =1{1 item} other{{count} items}}
ar: {count, plural, =0{لا عناصر} =1{عنصر واحد} =2{عنصران} few{{count} عناصر} many{{count} عنصرًا} other{{count} عنصر}}
ms: {count, plural, =0{Tiada item} =1{1 item} other{{count} item}}

# days_remaining
source: {count, plural, =0{Today} =1{Tomorrow} other{In {count} days}}
ar: {count, plural, =0{اليوم} =1{غدًا} =2{بعد يومين} few{بعد {count} أيام} many{بعد {count} يومًا} other{بعد {count} يوم}}
ms: {count, plural, =0{Hari ini} =1{Esok} other{Dalam {count} hari}}

# actionCardsTitle
source: Daily Actions
ar: المهام اليومية
ms: Tindakan Harian

# allCardsDone
source: All done for today!
ar: أنجزت كل شيء اليوم!
ms: Semua selesai hari ini!

# allCardsDoneSubtitle
source: Come back tomorrow for fresh ideas
ar: عد غدًا لأفكار جديدة
ms: Kembali esok untuk idea baharu

source: What to do
ar: ماذا تفعل
ms: Apa yang perlu dilakukan

source: How did it go?
ar: كيف سارت الأمور؟
ms: Bagaimana hasilnya?

# optionalNotes
source: Add notes (optional)
ar: أضف ملاحظات (اختياري)
ms: Tambah nota (pilihan)

source: Mark Complete
ar: تم الإنجاز
ms: Tandakan Selesai

# gamification
source: Progress
ar: التقدم
ms: Kemajuan

source: Badges
ar: الشارات
ms: Lencana

# sosTitle
source: SOS Mode
ar: وضع الطوارئ
ms: Mod SOS

# sosSubtitle
source: Emergency help when she's upset
ar: مساعدة عاجلة عندما تكون منزعجة
ms: Bantuan kecemasan apabila dia kecewa

# getHelp
source: Get Help Now
ar: احصل على المساعدة
ms: Dapatkan Bantuan

source: Assessment
ar: التقييم
ms: Penilaian

source: Back
ar: رجوع
ms: Kembali

source: Coaching
ar: التوجيه
ms: Bimbingan

# stepProgress
source: Step {current} of {total}
ar: الخطوة {current} من {total}
ms: Langkah {current} daripada {total}

source: Say This
ar: قل هذا
ms: Katakan Ini

# dontSay
source: Don't Say This
ar: لا تقل هذا
ms: Jangan Katakan Ini

source: What happened?
ar: ماذا حدث؟
ms: Apa yang berlaku?

source: Next Step
ar: الخطوة التالية
ms: Langkah Seterusnya

source: View Recovery Plan
ar: عرض خطة التعافي
ms: Lihat Pelan Pemulihan

source: Recovery Plan
ar: خطة التعافي
ms: Pelan Pemulihan

source: Immediate
ar: فوري
ms: Segera

# immediateStep1
source: Apologize sincerely
ar: اعتذر بصدق
ms: Minta maaf dengan ikhlas

# immediateStep2
source: Give her space if needed
ar: أعطها مساحة إذا لزم الأمر
ms: Beri dia ruang jika perlu

# immediateStep3
source: Listen without defending
ar: استمع بدون دفاع
ms: Dengar tanpa membela diri

source: Short Term
ar: قصير المدى
ms: Jangka Pendek

# shortTermStep1
source: Plan a thoughtful gesture
ar: خطط لبادرة مدروسة
ms: Rancang isyarat yang bermakna

# shortTermStep2
source: Follow through on promises
ar: التزم بوعودك
ms: Tunaikan janji anda

source: Long Term
ar: طويل المدى
ms: Jangka Panjang

# longTermStep1
source: Address the root cause
ar: عالج السبب الجذري
ms: Tangani punca masalah

# longTermStep2
source: Build new habits together
ar: ابنِ عادات جديدة معاً
ms: Bina tabiat baru bersama

source: Done
ar: تم
ms: Selesai

source: Upgrade Plan
ar: ترقية الخطة
ms: Naik Taraf Pelan

# noPlansAvailable
source: No plans available at this time
ar: لا توجد خطط متاحة حالياً
ms: Tiada pelan tersedia pada masa ini

source: Restore Purchases
ar: استعادة المشتريات
ms: Pulihkan Pembelian

# subscriptionTerms
source: Terms & Conditions apply
ar: تطبق الشروط والأحكام
ms: Terma & Syarat terpakai

source: Unlock Full Potential
ar: افتح الإمكانيات الكاملة
ms: Buka Potensi Penuh

# paywallSubtitle
source: Get unlimited access to all features
ar: احصل على وصول غير محدود لجميع الميزات
ms: Dapatkan akses tanpa had ke semua ciri
